app/views/statistics/_duel_table.html.erb

			<%if match.score.present?%>
				<% wl = ((Registration.find(match.winner).user.id == current_user.id  )) ? true : false   %>
---
SELECT "registrations"."id" FROM "registrations" WHERE "registrations"."user_id" = $1  [["user_id", 5]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]