app/views/statistics/duel.html.erb

SELECT "registrations".* FROM "registrations" WHERE "registrations"."id" = $1 LIMIT $2  [["id", 647], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
					<%if match.score.present?%>
						<% wl = ((Registration.find(match.winner).user.id == current_user.id  )) ? true : false   %>