app/views/tournaments/_brackets_partial.html.erb

					<%if @tournament.double == true%>
					<li class="team team-top"><%= Registration.find(match.first_player).name %><span class="score"><%= match.score %></span></li>
---
SELECT "registrations".* FROM "registrations" WHERE "registrations"."id" = $1 LIMIT $2  [["id", 647], ["LIMIT", 1]]

					<%else%>
					<li class="team team-top"><%= Registration.find(match.first_player).user.username %><span class="score"><%= match.score %></span></li>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]