app/views/tournaments/_groups_partial.html.erb

                            <% if @tournament.double == false  %>
                                <%= "#{Registration.find(match.first_player).user.username} vs #{Registration.find(match.second_player).user.username}" %>
---
SELECT "registrations".* FROM "registrations" WHERE "registrations"."id" = $1 LIMIT $2  [["id", 646], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]