app/views/tournaments/_player_info.html.erb

      <% eval(players_variable_name).each do |id, user_id| %>
        <% id_reg = Registration.find(id) %>
---
SELECT "registrations".* FROM "registrations" WHERE "registrations"."id" = $1 LIMIT $2  [["id", 647], ["LIMIT", 1]]

          <% if current_user.admin? %>
            <%= link_to User.find(user_id).username, user_path(user_id), class: 'user-link', target: "_blank" %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]