app/views/shared/_add_match.html.erb

SELECT "registrations"."user_id" FROM "registrations" WHERE "registrations"."tournament_id" = $1 AND "registrations"."level_registration" = $2  [["tournament_id", 136], ["level_registration", "level_2"]]
---

<% regs_users = tournament.registrations.where(level_registration: "level_2").pluck(:user_id) %>

SELECT "users".* FROM "users" WHERE "users"."id" IN (SELECT "users"."id" FROM "users" WHERE "users"."id" IN ($1, $2))  [["id", 28], ["id", 5]]
SELECT "groups"."id" FROM "groups" WHERE "groups"."tournament_id" = $1  [["tournament_id", 136]]
---

<% users = User.where(id: regs_users) %>

<% groups = tournament.groups.pluck(:id) %>

SELECT "groups".* FROM "groups" WHERE "groups"."id" IN ($1, $2)  [["id", 267], ["id", 268]]
---
    <br>
    <%= select_tag "group_id", options_from_collection_for_select(Group.where(id: groups), "id", "id"), prompt: "Select Group", class: "form-control w-100 mb-2" %>