app/views/shared/_create_point.html.erb

SELECT "registrations"."user_id" FROM "registrations" WHERE "registrations"."tournament_id" = $1  [["tournament_id", 136]]
SELECT "registrations"."teammate_id" FROM "registrations" WHERE "registrations"."tournament_id" = $1  [["tournament_id", 135]]
---

<% users = tournament.registrations.pluck(:user_id)  %>
<% if tournament.double == true %>
    <%users += tournament.registrations.pluck(:teammate_id)%>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
        <div class="mb-2">
          <%= label_tag "points_#{user_id}", "Points for #{User.find(user_id).username}:", class: "small-text" %>