app/views/shared/_prom_form.html.erb

SELECT "users".* FROM "users"
---
<%= form_tag create_promotion_users_path, method: :post, class: "w-100", data: { controller: 'tweet-form' } do %>
	<%= select_tag "user_id", options_from_collection_for_select(User.all, "id", "username"), prompt: "Select User", class: "form-control w-100 mb-2" %>