app/controllers/dashboard_controller.rb

SELECT "tweets".* FROM "tweets" ORDER BY "tweets"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4, $5)  [["id", 28], ["id", 5], ["id", 12], ["id", 25], ["id", 21]]
SELECT "tournaments".* FROM "tournaments" ORDER BY "tournaments"."created_at" DESC
---
	def index
		@tweets = Tweet.includes(:liked_users, :bookmarked_users, :user).order(created_at: :desc).map do |tweet|
			TweetPresenter.new(tweet: tweet, current_user: current_user)
		end
		@all_tournaments = Tournament.includes(:registrated_users, :user).order(created_at: :desc).map do |tournament|