app/controllers/groups_controller.rb

SELECT "rounds".* FROM "rounds" WHERE "rounds"."id" = $1 LIMIT $2  [["id", 95], ["LIMIT", 1]]
SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 136], ["LIMIT", 1]]
SELECT "rounds".* FROM "rounds" WHERE "rounds"."tournament_id" = $1 AND "rounds"."level" = $2  [["tournament_id", 136], ["level", "level_2"]]
SELECT "matches".* FROM "matches" WHERE "matches"."round_id" = $1 AND "matches"."kind" = $2 ORDER BY "matches"."created_at" ASC  [["round_id", 95], ["kind", "bracket"]]
SELECT "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 701], ["LIMIT", 1]]
UPDATE "matches" SET "updated_at" = $1, "date" = $2 WHERE "matches"."id" = $3  [["updated_at", "2024-02-23 21:46:18.211310"], ["date", "2024-02-13 23:46:00"], ["id", 703]]
---
	def update_scores_group
		if params[:rounds_submit] != nil
			tournament_id = Round.find(params[:id]).tournament.id
			level_round = Round.find(params[:id]).level
			@tournament = Tournament.find(tournament_id)
			@rounds_medium = @tournament.rounds.where(level: level_round)
			@rounds_with_matches = {}
			@rounds_medium.each do |round|
				matches = round.matches.where(kind: "bracket") # Assuming you have a `has_many :matches` association in your Group model
				@rounds_with_matches[round] = matches
			end
		end

		params[:match_scores].each do |match_id, score|
			match = Match.find(match_id)
			first_player = match.first_player
			second_player = match.second_player
			match.update(score: score)

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 269], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."tournament_id" = $1 AND "groups"."level" = $2  [["tournament_id", 135], ["level", "level_2"]]
SELECT "matches".* FROM "matches" WHERE "matches"."group_id" = $1 AND "matches"."kind" = $2  [["group_id", 269], ["kind", "group"]]
---
	def print_groups_medium
		group = Group.find(params[:id])
		@tournament = group.tournament
		@groups_medium = @tournament.groups.where(level: "level_2")

		@groups_with_matches = {}
		@groups_medium.each do |group|
			matches = group.matches.where(kind: "group") # Assuming you have a `has_many :matches` association in your Group model