app/controllers/registrations_controller.rb

INSERT INTO "registrations" ("tournament_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tournament_id", 136], ["user_id", 5], ["created_at", "2024-02-23 22:40:49.140130"], ["updated_at", "2024-02-23 22:40:49.140130"]]
UPDATE "registrations" SET "updated_at" = $1, "level_registration" = $2 WHERE "registrations"."id" = $3  [["updated_at", "2024-02-23 22:40:49.146831"], ["level_registration", "level_2"], ["id", 656]]
UPDATE "tournaments" SET "registrations_count" = COALESCE("registrations_count", 0) + $1 WHERE "tournaments"."id" = $2  [["registrations_count", 1], ["id", 136]]
---
	def create_level_two
		if tournament.status == true
			if current_user.level == "Beginner" || current_user.level == "Medium" || current_user.level == "Medium Plus"
				@eligible = true
				@registration = current_user.registrations.create(tournament: tournament)
				@registration.update(waitlisted: tournament.confirmation)

SELECT "registrations".* FROM "registrations" WHERE "registrations"."tournament_id" = $1 AND "registrations"."id" = $2 LIMIT $3  [["tournament_id", 136], ["id", 646], ["LIMIT", 1]]
DELETE FROM "registrations" WHERE "registrations"."id" = $1  [["id", 646]]
---
	def destroy
		if tournament.status == true
			@registration = tournament.registrations.find(params[:id])
			@registration.destroy

SELECT "registrations".* FROM "registrations" WHERE "registrations"."id" = $1 LIMIT $2  [["id", 650], ["LIMIT", 1]]
SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 135], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "registrations" SET "updated_at" = $1, "waitlisted" = $2 WHERE "registrations"."id" = $3  [["updated_at", "2024-02-22 15:10:27.244211"], ["waitlisted", true], ["id", 650]]
SELECT "registrations"."id", "registrations"."user_id" FROM "registrations" WHERE "registrations"."tournament_id" = $1 AND "registrations"."level_registration" = $2 AND "registrations"."waitlisted" = $3  [["tournament_id", 135], ["level_registration", "level_1"], ["waitlisted", false]]
SELECT "registrations"."id", "registrations"."user_id" FROM "registrations" WHERE "registrations"."tournament_id" = $1 AND "registrations"."waitlisted" = $2  [["tournament_id", 135], ["waitlisted", true]]
---
	def modify_waitlisted_users
		@registration = Registration.find(params[:id])
		@tournament = Tournament.find(params[:tournament_id])
		@user = User.find(@registration.user_id)
		@registration.toggle!(:waitlisted)
		@action = "WaitListed"

		@players_lvl_beginner = @tournament.registrations.where(level_registration: "level_1", waitlisted: false).pluck(:id, :user_id)
		@players_lvl_medium = @tournament.registrations.where(level_registration: "level_2", waitlisted: false).pluck(:id, :user_id)
		@players_lvl_mediumplus = @tournament.registrations.where(level_registration: "level_3", waitlisted: false).pluck(:id, :user_id)
		@players_lvl_expert = @tournament.registrations.where(level_registration: "level_4", waitlisted: false).pluck(:id, :user_id)
		@players_lvl_waitlisted = @tournament.registrations.where(waitlisted: true).pluck(:id, :user_id)