app/controllers/rounds_controller.rb

SELECT "rounds".* FROM "rounds" WHERE "rounds"."id" = $1 LIMIT $2  [["id", 95], ["LIMIT", 1]]
DELETE FROM "rounds" WHERE "rounds"."id" = $1  [["id", 95]]
---
	def destroy
		@round = Round.find(params[:id])
		@round.destroy