app/controllers/statistics_controller.rb

SELECT "matches".* FROM "matches" WHERE (first_player IN (646,655) OR second_player IN (646,655)) LIMIT $1 OFFSET $2  [["LIMIT", 13], ["OFFSET", 0]]
---
	def duel
		@pagy, @matches_for_current_user = pagy(Match.for_current_user(current_user), items: 13)
		registration_ids = Registration.where(teammate_id: current_user.id).pluck(:id)
        @all_teammates = Match.where('first_player IN (?) OR second_player IN (?)', registration_ids, registration_ids) || []