app/controllers/tournaments_controller.rb

SELECT "registrations"."id", "registrations"."user_id" FROM "registrations" WHERE "registrations"."tournament_id" = $1 AND "registrations"."waitlisted" = $2  [["tournament_id", 136], ["waitlisted", true]]
---
	def show
		@tournament = Tournament.find(params[:id])
		@players_lvl_beginner = @tournament.registrations.where(level_registration: "level_1", waitlisted: false).pluck(:id, :user_id)
		@players_lvl_medium = @tournament.registrations.where(level_registration: "level_2", waitlisted: false).pluck(:id, :user_id)
		@players_lvl_mediumplus = @tournament.registrations.where(level_registration: "level_3", waitlisted: false).pluck(:id, :user_id)
		@players_lvl_expert = @tournament.registrations.where(level_registration: "level_4", waitlisted: false).pluck(:id, :user_id)
		@players_lvl_waitlisted = @tournament.registrations.where(waitlisted: true).pluck(:id, :user_id)