app/controllers/tournaments_controller.rb

SELECT "tournaments".* FROM "tournaments" INNER JOIN (SELECT "tournaments"."id" AS pg_search_id, (ts_rank((to_tsvector('simple', coalesce("tournaments"."status"::text, ''))), (to_tsquery('simple', ''' ' || 's' || ' ''' || ':*')), 0)) AS rank FROM "tournaments" WHERE ((to_tsvector('simple', coalesce("tournaments"."status"::text, ''))) @@ (to_tsquery('simple', ''' ' || 's' || ' ''' || ':*')))) AS pg_search_1953e64568644e6670e345 ON "tournaments"."id" = pg_search_1953e64568644e6670e345.pg_search_id WHERE "tournaments"."league" = $1 ORDER BY pg_search_1953e64568644e6670e345.rank DESC, "tournaments"."id" ASC, "tournaments"."created_at" DESC  [["league", false]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4, $5)  [["id", 28], ["id", 5], ["id", 12], ["id", 25], ["id", 21]]
---
	def index

		if params[:status].present?
			@pagy, @all_tournaments = pagy_array(Tournament.search_by_status(params[:status]).where(league: false).includes(:registrated_users, :user).order(created_at: :desc).map do |tournament|
				TournamentPresenter.new(tournament: tournament, current_user: current_user)
			end,
			items: 5
			)

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 136], ["LIMIT", 1]]
SELECT "registrations"."id", "registrations"."user_id" FROM "registrations" WHERE "registrations"."tournament_id" = $1 AND "registrations"."level_registration" = $2 AND "registrations"."waitlisted" = $3  [["tournament_id", 136], ["level_registration", "level_1"], ["waitlisted", false]]
SELECT "registrations"."id", "registrations"."user_id" FROM "registrations" WHERE "registrations"."tournament_id" = $1 AND "registrations"."waitlisted" = $2 ORDER BY "registrations"."created_at" DESC  [["tournament_id", 136], ["waitlisted", true]]
---
	def show
		@tournament = Tournament.find(params[:id])
		if @tournament.double == false
			@players_lvl_beginner = @tournament.registrations.where(level_registration: "level_1", waitlisted: false).pluck(:id, :user_id)
			@players_lvl_medium = @tournament.registrations.where(level_registration: "level_2", waitlisted: false).pluck(:id, :user_id)
			@players_lvl_mediumplus = @tournament.registrations.where(level_registration: "level_3", waitlisted: false).pluck(:id, :user_id)
			@players_lvl_expert = @tournament.registrations.where(level_registration: "level_4", waitlisted: false).pluck(:id, :user_id)
			@players_lvl_waitlisted = @tournament.registrations.where(waitlisted: true).order(created_at: :desc).pluck(:id, :user_id)

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 136], ["LIMIT", 1]]
UPDATE "tournaments" SET "status" = $1, "updated_at" = $2 WHERE "tournaments"."id" = $3  [["status", true], ["updated_at", "2024-02-23 22:40:44.540246"], ["id", 136]]
---
	def change_status_opened
		@tournament = Tournament.find(params[:id])
		@tournament.update(status: true)

SELECT "groups".* FROM "groups" ORDER BY "groups"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 136], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 267], ["LIMIT", 1]]
SELECT "registrations".* FROM "registrations" WHERE "registrations"."id" = $1 LIMIT $2  [["id", 647], ["LIMIT", 1]]
---
	def create_brackets
		reg_seed = {}
		params[:selected_players].each do |reg, seed|
			if seed.present?
				reg_seed[reg] = seed
			end
		end

		inverted_grouped_params = reg_seed.group_by { |_, value| value }.transform_values { |entries| entries.map(&:first) }
		checking = inverted_grouped_params.select { |key, values| values.length != 2 }.keys

		if reg_seed.length < 2 || !checking.empty?
			respond_to do |format|
				format.html { redirect_to dashboard_path }
				format.turbo_stream do
					render turbo_stream: turbo_stream.prepend('altceva') {
						"<div class=\"alert alert-danger alert-dismissible fade show\" role=\"alert\" style=\"position: fixed; top: 10px; right: 10px; width: 300px; display: inline-block;\">
						<strong style=\"font-size: 12px;\">Ooops!</strong> <font style=\"font-size: 12px;\">Something went worng!</font>
							<button type=\"button\" class=\"btn-close btn-sm\" data-bs-dismiss=\"alert\" aria-label=\"Close\"></button>
						</div>".html_safe
					}
				end
			end
			return nil
		end

		tournament = Tournament.find(params[:id])
		level_round = Registration.find(reg_seed.first.first.to_i).level_registration

INSERT INTO "rounds" ("tournament_id", "level", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tournament_id", 136], ["level", "level_2"], ["created_at", "2024-02-23 22:28:47.092238"], ["updated_at", "2024-02-23 22:28:47.092238"]]
---
			level = "Expert"
		end

		round = Round.create(level: level_round, tournament: tournament)

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 136], ["LIMIT", 1]]
SELECT "registrations".* FROM "registrations" WHERE "registrations"."id" = $1 LIMIT $2  [["id", 647], ["LIMIT", 1]]
INSERT INTO "groups" ("level", "tournament_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["level", "level_2"], ["tournament_id", 136], ["created_at", "2024-02-19 12:03:13.529882"], ["updated_at", "2024-02-19 12:03:13.529882"]]
---
	def create_groups
		if params[:selected_players]&.length < 2
			respond_to do |format|
				format.html { redirect_to dashboard_path }
				format.turbo_stream do
					render turbo_stream: turbo_stream.prepend('altceva') {
						"<div class=\"alert alert-danger alert-dismissible fade show\" role=\"alert\" style=\"position: fixed; top: 10px; right: 10px; width: 300px; display: inline-block;\">
						<strong style=\"font-size: 12px;\">Ooops!</strong> <font style=\"font-size: 12px;\">Something went worng!.</font>
							<button type=\"button\" class=\"btn-close btn-sm\" data-bs-dismiss=\"alert\" aria-label=\"Close\"></button>
						</div>".html_safe
					}
				end
			end
			return nil
		end

		tournament = Tournament.find(params[:id])
    selected_player_ids = params[:selected_players] || []
		selected_player_ids = selected_player_ids.map(&:to_i)
		level_group = Registration.find(selected_player_ids.first).level_registration
		group = Group.create(level: level_group, tournament: tournament)

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 136], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."tournament_id" = $1 AND "groups"."level" = $2  [["tournament_id", 136], ["level", "level_2"]]
SELECT "rounds".* FROM "rounds" WHERE "rounds"."tournament_id" = $1 AND "rounds"."level" = $2 ORDER BY "rounds"."created_at" DESC LIMIT $3  [["tournament_id", 136], ["level", "level_2"], ["LIMIT", 1]]
SELECT "groups"."id" FROM "groups" WHERE "groups"."tournament_id" = $1  [["tournament_id", 136]]
SELECT "matches".* FROM "matches" WHERE "matches"."round_id" = $1 AND "matches"."kind" = $2 ORDER BY "matches"."created_at" ASC  [["round_id", 95], ["kind", "bracket"]]
SELECT "matches".* FROM "matches" WHERE "matches"."round_id" = $1 ORDER BY "matches"."id" ASC LIMIT $2  [["round_id", 95], ["LIMIT", 1]]
---
	def medium_schedule
		@tournament = Tournament.find(params[:id])
		@groups_medium = @tournament.groups.where(level: "level_2")
		@rounds_medium = @tournament.rounds.where(level: "level_2")

		@last_match = @tournament.rounds.where(level: "level_2").order(created_at: :desc).first&.matches&.size
		if @last_match == 1 && @tournament.rounds.where(level: "level_2").order(created_at: :desc).first.matches.first&.winner != nil
			@winner = Registration.find(@tournament.rounds.where(level: "level_2").order(created_at: :desc).first.matches.first&.winner).user.username
		end

		@groups_with_matches = {}
		@groups_medium.each do |group|
			matches = group.matches.where(kind: "group") # Assuming you have a `has_many :matches` association in your Group model
			@groups_with_matches[group] = matches
		end

		@rounds_with_matches = {}
		@rounds_medium.each do |round|
			matches = round.matches.where(kind: "bracket").order(created_at: :asc) # Assuming you have a `has_many :matches` association in your Group model
			@rounds_with_matches[round] = matches
		end

		@data = {}

		@groups_medium.each do |group|
			@data[group.id] = {}

			group.matches.where(kind: "group").each do |match|
				winner_id = match.winner
				loser_id = match.first_player == match.winner ? match.second_player : match.first_player

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = $1 LIMIT $2  [["id", 137], ["LIMIT", 1]]
UPDATE "tournaments" SET "status" = $1, "updated_at" = $2 WHERE "tournaments"."id" = $3  [["status", false], ["updated_at", "2024-02-22 15:22:48.275480"], ["id", 137]]
---
	def change_status_closed
		@tournament = Tournament.find(params[:id])
		@tournament.update(status: false)