app/controllers/users_controller.rb

	def show
		@user = User.find(params[:id])
		lvl_user = @user.level
		users = User.where(level: @user.level).order(points: :desc)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."level" = $1 ORDER BY "users"."points" DESC  [["level", "Medium"]]