app/controllers/usernames_controller.rb

SELECT "users".* FROM "users"
---
	def index
		if params[:username].present?
			@pagy, @users = pagy(User.search_by_username(params[:username]),  items: 13)
		else
			@pagy, @users = pagy(User.all,  items: 13)